<?php

//ー課題内容ー
  //HTMLについて調べましょう。
  //HTMLには入力フィールド意外にも様々なタグが存在します。
  //Webページをデザインする上で欠かせない知識なので、タグを調べ、色々と使ってみましょう。

//ー以下、調べたタグの一覧ー

// <!-- -->
  //PHPでいうコメントアウト（//）と同じ内容
   //実際に表示させたくない内容を<!--　から　-->の間に入れることにより
   //入れた内容は表示されない。

//<font> </font>
  //文字の大きさを変えたい時に使うタグ
   //<font size= "数字">で指定した文字の大きさに変えられる
   //指定できるサイズは１〜７まで
   //デフォルト値は３なので指定しないと３の大きさになる

//<font color="色">　</font>
  //文字の色を変えることができるタグ
   //色の部分をカラーネーム（青ならblueなど）で指定するか
   //カラーコード（種類は検索するとたくさん出てくるが、例えば青なら#FFFF00など）で指定するか
   //二つのパターンがある。
   //ページ背景に合わせて色を表示させることによって閲覧者側に見やすくする。

//<strong>  </strong>
  //文字を強調させるタグ
   //強調させたい文字を太くさせることができる。
   //例えばブログなどで特に知ってもらいたい内容にこのタグを使うことによって
   //読み手側に内容をわかりやすくすることができる。

//<u>～</u>
  //文字に下線をつけたい時に使うタグ。
   //<strong>タグと同じように文字を強調させたい時や
   //重要な箇所に下線を引きたい時に使える。

//<ruby> <rb> <rt> </ruby>
  //指定した漢字にふりがなを付けるタグ
   //<ruby><rb>漢字<rt>フリガナ</ruby>　という風に配置する
    //例１：<ruby><rb>豊川<rt>トヨカワ</ruby>
    //例２：<ruby><rb>本気<rt>マジ</ruby>
      //例１みたいに難しい漢字を表示させる時や
      //例２みたいに面白く表示させる時に使える。

//<div align="位置"> </div>
  //文字の行揃えを行うことができるタグ
   //行揃えできる位置は　左　中央　右　の三つ。
   //alignの後の""に位置を指定することにより、それぞれ対応した位置に配置できる。　
   //ちなみにこのタグで囲まれた部分は<br>タグと同じように改行される。


//以上が今のところ自分の知っている知識と合わせて使えそうなタグ一覧です。







?>
